darrylb123/ESP32_SMA-Inverter-MQTT/src/SMA_Inverter.cpp
  if (pcktBufPos > pcktBufMax) {
    pcktBufMax = pcktBufPos;
    DEBUG2_PRINTF("pcktBufMax is now %d bytes\n", pcktBufMax);
  }

  return rc;
}

// *************************************************

void ESP32_SMA_Inverter::writePacketHeader(uint8_t *buf, const uint16_t control, const uint8_t *destaddress) {
  //extern uint16_t fcsChecksum;


    pcktBufPos = 0;

    fcsChecksum = 0xFFFF;
    buf[pcktBufPos++] = 0x7E;
    buf[pcktBufPos++] = 0;  //placeholder for len1
    buf[pcktBufPos++] = 0;  //placeholder for len2
    buf[pcktBufPos++] = 0;  //placeholder for checksum
    int i;
    for(i = 0; i < 6; i++) buf[pcktBufPos++] = espBTAddress[i];
    for(i = 0; i < 6; i++) buf[pcktBufPos++] = destaddress[i];

    buf[pcktBufPos++] = (uint8_t)(control & 0xFF);
    buf[pcktBufPos++] = (uint8_t)(control >> 8);
}
// ***********************************************
E_RC ESP32_SMA_Inverter::getInverterDataCfl(uint32_t command, uint32_t first, uint32_t last) {
  //extern uint8_t sixff[6];
    pcktID++;
    writePacketHeader(pcktBuf, 0x01, sixff); //addr_unknown);
    //if (invData.SUSyID == SID_SB240)
    //writePacket(pcktBuf, 0x09, 0xE0, 0, invData.SUSyID, invData.Serial);
    //else
    writePacket(pcktBuf, 0x09, 0xA0, 0, invData.SUSyID, invData.Serial);
    write32(pcktBuf, command);
    write32(pcktBuf, first);
    write32(pcktBuf, last);
    writePacketTrailer(pcktBuf);
    writePacketLength(pcktBuf);

    BTsendPacket(pcktBuf);
    int string[3] = { 0,0,0 }; //String number count

    uint8_t pcktcount = 0;
    bool  validPcktID = false;
    do {
    do {
      invData.status = getPacket(invData.BTAddress, 0x0001);
   
      if (invData.status != E_OK) return invData.status;
      if (validateChecksum()) {
        if ((invData.status = (E_RC)get_u16(pcktBuf + 23)) != E_OK) {
          DEBUG2_PRINTF("Packet status: 0x%02X\n", invData.status);
          return invData.status;
        }
        // *** analyze received data ***
        pcktcount = get_u16(pcktBuf + 25);
        uint16_t rcvpcktID = get_u16(pcktBuf + 27) & 0x7FFF;
        if (pcktID == rcvpcktID) {
          if ((get_u16(pcktBuf + 15) == invData.SUSyID) 
            && (get_u32(pcktBuf + 17) == invData.Serial)) {
            validPcktID = true;
            value32 = 0;
            value64 = 0;
            uint16_t recordsize = 4 * ((uint32_t)pcktBuf[5] - 9) / (get_u32(pcktBuf + 37) - get_u32(pcktBuf + 33) + 1);
            DEBUG2_PRINTF("\npcktID=0x%04x recsize=%d BufPos=%d pcktCnt=%04x", 
                            rcvpcktID,   recordsize, pcktBufPos, pcktcount);
            for (uint16_t ii = 41; ii < pcktBufPos - 3; ii += recordsize) {
              uint8_t *recptr = pcktBuf + ii;
              uint32_t code = get_u32(recptr);
              //LriDef lri = (LriDef)(code & 0x00FFFF00);
              uint16_t lri = (code & 0x00FFFF00) >> 8;
              uint32_t cls = code & 0xFF;
              uint8_t dataType = code >> 24;
              time_t datetime = (time_t)get_u32(recptr + 4);
              DEBUG3_PRINTF("\nlri=0x%04x cls=0x%08X dataType=0x%02x",lri, cls, dataType);
       
              if (recordsize == 16) {
                value64 = get_u64(recptr + 8);
                DEBUG3_PRINTF("\nvalue64=%d=0x%08x",value64, value64);
       
                  //if (is_NaN(value64) || is_NaN((uint64_t)value64)) value64 = 0;
              } else if ((dataType != 16) && (dataType != 8)) { // ((dataType != DT_STRING) && (dataType != DT_STATUS)) {
                value32 = get_u32(recptr + 16);
                if ( value32 < 0) value32 = 0;
                DEBUG3_PRINTF("\nvalue32=%d=0x%08x",value32, value32);
              }
              switch (lri) {
              case GridMsTotW: //SPOT_PACTOT
                  //This function gives us the time when the inverter was switched off
                  invData.LastTime = datetime;
                  invData.Pac = value32;
                  dispData.Pac = tokW(value32);
                  //debug_watt("SPOT_PACTOT", value32, datetime);
                  printUnixTime(timeBuf, datetime);
                  DEBUG1_PRINTF("Pac %15.3f kW %x \n GMT:%s \n", tokW(value32),value32, timeBuf);
                  break;
       
              case GridMsWphsA: //SPOT_PAC1
                  invData.Pmax = value32;
                  dispData.Pmax = tokW(value32);
                  //debug_watt("SPOT_PAC1", value32, datetime);
                  DEBUG1_PRINTF("Pmax %14.2f kW \n", tokW(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;
       
              case GridMsPhVphsA: //SPOT_UAC1
                  invData.Uac[0] = value32;
                  dispData.Uac[0] = toVolt(value32);
                  //debug_volt("SPOT_UAC1", value32, datetime);
                  DEBUG1_PRINTF("UacA %15.2f V  \n", toVolt(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;
              case GridMsPhVphsB: //SPOT_UAC2
                  invData.Uac[1] = value32;
                  dispData.Uac[1] = toVolt(value32);
                  //debug_volt("SPOT_UAC1", value32, datetime);
                  DEBUG1_PRINTF("UacB %15.2f V  \n", toVolt(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;     
                case GridMsPhVphsC: //SPOT_UAC2
                  invData.Uac[2] = value32;
                  dispData.Uac[2] = toVolt(value32);
                  //debug_volt("SPOT_UAC1", value32, datetime);
                  DEBUG1_PRINTF("UacC %15.2f V  \n", toVolt(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;       
              case GridMsAphsA_1: //SPOT_IAC1
              case GridMsAphsA:
                  invData.Iac[0] = value32;
                  dispData.Iac[0] = toAmp(value32);
                  //debug_amp("SPOT_IAC1", value32, datetime);
                  DEBUG1_PRINTF("IacA %15.2f A  \n", toAmp(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;
              case GridMsAphsB_1: //SPOT_IAC1
              case GridMsAphsB:
                  invData.Iac[1] = value32;
                  dispData.Iac[1] = toAmp(value32);
                  //debug_amp("SPOT_IAC1", value32, datetime);
                  DEBUG1_PRINTF("IacB %15.2f A  \n", toAmp(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;
              case GridMsAphsC_1: //SPOT_IAC1
              case GridMsAphsC:
                  invData.Iac[2] = value32;
                  dispData.Iac[2] = toAmp(value32);
                  //debug_amp("SPOT_IAC1", value32, datetime);
                  DEBUG1_PRINTF("IacB %15.2f A  \n", toAmp(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;
       
