darrylb123/ESP32_SMA-Inverter-MQTT/src/SMA_Inverter.cpp
              case GridMsHz: //SPOT_FREQ
                  invData.Freq = value32;
                  dispData.Freq = toHz(value32);
                  DEBUG1_PRINTF("Freq %14.2f Hz \n", toHz(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;
       
              case DcMsWatt: //SPOT_PDC1 / SPOT_PDC2
                  invData.Wdc[string[0]] = value32;
                  dispData.Wdc[string[0]++] = tokW(value32);
                  DEBUG1_PRINTF("PDC %15.2f kW \n", tokW(value32));
                  //printUnixTime(timeBuf, datetime);
                  break;
       
              case DcMsVol: //SPOT_UDC1 / SPOT_UDC2
                  DEBUG1_PRINTF("Udc %15.2f V (%d) \n", toVolt(value32),string[1]);
                  invData.Udc[string[1]] = value32;
                  dispData.Udc[string[1]++] = toVolt(value32);
                  
                  //printUnixTime(timeBuf, datetime);
                  break;
       
              case DcMsAmp: //SPOT_IDC1 / SPOT_IDC2
                  DEBUG1_PRINTF("Idc %15.2f A (%d)\n", toAmp(value32),string[2]);
                  invData.Idc[string[2]] = value32;
                  dispData.Idc[string[2]++] = toAmp(value32);

                  //printUnixTime(timeBuf, datetime);
                  /* if ((invData.Udc[0]!=0) && (invData.Idc[0] != 0))
                    invData.Eta = ((uint64_t)invData.Uac * (uint64_t)invData.Iac * 10000) /
                                    ((uint64_t)invData.Udc[0] * (uint64_t)invData.Idc[0] );
                  else invData.Eta = 0;
                  DEBUG1_PRINTF("Efficiency %8.2f %%\n", toPercent(invData.Eta)); */
                  break;
       
              case MeteringDyWhOut: //SPOT_ETODAY
                  //This function gives us the current inverter time
                  //invData.InverterDatetime = datetime;
                  invData.EToday = value64;
                  dispData.EToday = tokWh(value64);
                  //debug_kwh("SPOT_ETODAY", value64, datetime);
                  DEBUG1_PRINTF("E-Today %11.3f kWh\n", tokWh(value64));
                  //printUnixTime(timeBuf, datetime);
                  break;
       
              case MeteringTotWhOut: //SPOT_ETOTAL
                  //In case SPOT_ETODAY missing, this function gives us inverter time (eg: SUNNY TRIPOWER 6.0)
                  //invData.InverterDatetime = datetime;
                  invData.ETotal = value64;
                  dispData.ETotal = tokWh(value64);
                  //debug_kwh("SPOT_ETOTAL", value64, datetime);
                  DEBUG1_PRINTF("E-Total %11.3f kWh\n", tokWh(value64));
                  //printUnixTime(timeBuf, datetime);
                  break;
       
              case MeteringTotOpTms: //SPOT_OPERTM
                  invData.OperationTime = value64;
                  //debug_hour("SPOT_OPERTM", value64, datetime);
                  DEBUG1_PRINTF("OperTime  %7.3f h \n", toHour(value64));
                  //printUnixTime(timeBuf, datetime);
                  break;
       
              case MeteringTotFeedTms: //SPOT_FEEDTM
                  invData.FeedInTime = value64;
                  //debug_hour("SPOT_FEEDTM", value64, datetime);
                  DEBUG1_PRINTF("FeedTime  %7.3f h  \n", toHour(value64));
                  //printUnixTime(timeBuf, datetime);
                  break;
       
              case CoolsysTmpNom:
                  invData.InvTemp = value32;
                  dispData.InvTemp = toTemp(value32);
                  DEBUG1_PRINTF("Temp.     %7.3f C \n", toTemp(value32));
                  break;
              case OperationHealth:
                  invData.DevStatus = value32;
                  DEBUG1_PRINTF("Device Status:    %d  \n", value32);
                  break;
              case OperationGriSwStt:
                  invData.GridRelay = value32;
                  DEBUG1_PRINTF("Grid Relay:    %d  \n", value32);
                  break;
              case MeteringGridMsTotWOut:
                  //invData.MeteringGridMsTotWOut = value32;
                  break;
              case MeteringGridMsTotWIn:
                  //invData.MeteringGridMsTotWIn = value32;
                  break;
              default:

                DEBUG1_PRINTF("Caught: %x %d\n",lri,value32);
              }
            } //for
          } else {
            DEBUG3_PRINTF("*** Wrong SUSyID=%04x=%04x Serial=%08x=%08x", 
                 get_u16(pcktBuf + 15), invData.SUSyID, get_u32(pcktBuf + 17),invData.Serial);
          }
        } else {  // wrong PacketID
          DEBUG3_PRINTF("PacketID mismatch: exp=0x%04X is=0x%04X\n", pcktID, rcvpcktID);
          validPcktID = false;
          pcktcount = 0;
        }
      } else { // invalid Checksum
        invData.status = E_CHKSUM;
        return invData.status;
      }
   } while (pcktcount > 0);
   } while (!validPcktID);
   return invData.status;
}
// ***********************************************
E_RC ESP32_SMA_Inverter::getInverterData(enum getInverterDataType type) {
  E_RC rc = E_OK;
  uint32_t command;
  uint32_t first;
  uint32_t last;

  switch (type) {
  case EnergyProduction:
      DEBUG2_PRINT("\n*** EnergyProduction ***");
      // SPOT_ETODAY, SPOT_ETOTAL
      command = 0x54000200;
      first = 0x00260100;
      last = 0x002622FF;
      break;

  case SpotDCPower:
      DEBUG2_PRINT("\n*** SpotDCPower ***");
      // SPOT_PDC1, SPOT_PDC2
      command = 0x53800200;
      first = 0x00251E00;
      last = 0x00251EFF;
      break;

  case SpotDCVoltage:
      DEBUG2_PRINT("\n*** SpotDCVoltage ***");
      // SPOT_UDC1, SPOT_UDC2, SPOT_IDC1, SPOT_IDC2
      command = 0x53800200;
      first = 0x00451F00;
      last = 0x004521FF;
      break;

  case SpotACPower:
      DEBUG2_PRINT("\n*** SpotACPower ***");
      // SPOT_PAC1, SPOT_PAC2, SPOT_PAC3
      command = 0x51000200;
      first = 0x00464000;
      last = 0x004642FF;
      break;

  case SpotACVoltage:
      DEBUG2_PRINT("\n*** SpotACVoltage ***");
      // SPOT_UAC1, SPOT_UAC2, SPOT_UAC3, SPOT_IAC1, SPOT_IAC2, SPOT_IAC3
      command = 0x51000200;
      first = 0x00464800;
      last = 0x004655FF;
      break;

